namespace VetClinicBKP.Model
{
    public class SpecialistRepo
    {
        public static List<Specialist> AllSpecialist => new List<Specialist>
        {
            new  Specialist
            {
                ID_Specialist = 1,
                Name = "Иванов А.А.",
                Description = "Специалист общей практики, занимающийся диагностикой, лечением и профилактикой различных заболеваний у домашних животных.",
                TypeSpecialist = "Терапевт",
                Service = "клинический осмотр со сбором анамнеза и инструментальным обследованием; \r\n" +
                "забор биоматериала (кровь, моча, кал, соскобы) для лабораторных анализов; \r\n" +
                "выдача направлений на УЗИ, ЭКГ, рентген, КТ, МРТ и другие виды исследований; \r\n" +
                "постановка предварительного и дифференциального диагноза; \r\n" +
                "составление индивидуального плана лечения на основе медикаментозной терапии; \r\n" +
                "контроль процесса выздоровления и коррекция назначений; \r\n" +
                "постановка капельниц, уколы, катетеризация, обработка ран и прочие процедуры; \r\n" +
                "консультации по правильному кормлению и содержанию животных; \r\n" +
                "плановая вакцинация, чипирование и оформление ветеринарных паспортов; \r\n" +
                "экспертные рекомендации по профилактике заболеваний",
                Price= "1000 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "9:00 - 15:00",
                    "10:00 - 14:00"
                }
            },

            new  Specialist
            {
                ID_Specialist = 2,
                Name = "Петров С.И.",
                Description = "Специалист по хирургии мелких животных",
                TypeSpecialist = "Хирург",
                Service = "Операции по стерилизации и кастрации, удалению злокачественных и доброкачественных образований, кесарево сечение, резекция и другие.",
                Price= "3000 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "- - - - - - -"
                }
            },

            new  Specialist
            {
                ID_Specialist = 3,
                Name = "Сидоров Е.К.",
                Description = "Врач-диагност, УЗИ и рентген",
                TypeSpecialist = "Диагност",
                Service = "Осмотр животного; Лабораторные исследования; Рентгенография, УЗИ, МРТ; Экспресс-тесты",
                Price= "1500 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "- - - - - - -"
                }
            },

            new  Specialist
            {
                ID_Specialist = 4,
                Name = "Васильева О.Н.",
                Description = "Ветеринар-дерматолог занимается диагностикой и лечением различных кожных заболеваний у животных",
                TypeSpecialist = "Дерматолог",
                Service = "собирает анамнез и проводит визуальный осмотр кожи, шерсти, слизистых и когтей;\r\n" +
                "делает лабораторные исследования: поверхностный и глубокий соскоб кожи, посев и другие (в зависимости от вида поражения);\r\n" +
                "после определения заболевания составляет грамотный план лечения;\r\n" +
                "даёт рекомендации по профилактике, чтобы не допустить повторного появления проблемы.",
                Price= "1200 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "9:00 - 15:00",
                    "10:00 - 14:00"
                }
            },

            new  Specialist
            {
                ID_Specialist = 5,
                Name = "Смирнов К.В.",
                Description = "Ветеринарный стоматолог занимается диагностикой, лечением и профилактикой заболеваний зубов и полости рта у животных.",
                TypeSpecialist = "Стоматолог",
                Service = "Чистка зубов\r\nДиагностика\r\nПрофилактические меры\r\nЛечение заболеваний\r\nХирургическое вмешательство",
                Price= "800 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "9:00 - 15:00",
                    "- - - - - - -"
                }
            },

            new  Specialist
            {
                ID_Specialist = 6,
                Name = "Козлова М.С.", 
                Description = "Ветеринар-ортопед занимается диагностикой и лечением патологий опорно-двигательного аппарата у животных.",
                TypeSpecialist = "Ортопед",
                Service = "Рентген конечностей\r\nТравматология\r\nРеконструкция\r\nЛечение врождённых патологий\r\nЭндопротезирование\r\nРеабилитация и физиотерапия",
                Price= "2000 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "- - - - - - -"
                }
            },

            new  Specialist
            {
                ID_Specialist = 7,
                Name = "Андреев П.Р.",
                Description = "Ветеринар-невролог занимается диагностикой, лечением и профилактикой различных заболеваний нервной системы у животных.",
                TypeSpecialist = "Невролог",
                Service = "Собирает анамнез\r\nПроводит неврологический осмотр\r\nРазрабатывает лечебную тактику",
                Price= "2500 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "9:00 - 15:00",
                    "10:00 - 14:00"
                }
            },

            new  Specialist
            {
                ID_Specialist = 8,
                Name = "Михайлова Л.Е.",
                Description = "Ветеринар-офтальмолог занимается диагностикой, профилактикой и лечением заболеваний органов зрения у животных. ",
                TypeSpecialist = "Офтальмолог",
                Service = "Первичные и профилактические осмотры\r\nПроведение офтальмологического осмотра и исследований, таких как офтальмоскопия, тонометрия, рентгенография, УЗИ, компьютерная томография, различные анализы.",
                Price= "1800 рублей",
                WorkingHours = new List<string>
                {
                    "- - - - - - -",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "9:00 - 15:00",
                    "10:00 - 14:00"
                }
            },

            new  Specialist
            {
                ID_Specialist = 9,
                Name = "Кузнецов Н.Д.",
                Description = "Ветеринарный кардиолог занимается диагностикой, лечением и профилактикой болезней сердца и сосудов у животных.",
                TypeSpecialist = "Кардиолог",
                Service = "Диагностика\r\nПодбор терапии\r\nКонтроль хронических заболеваний\r\nРеабилитация",
                Price= "1400 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "9:00 - 15:00",
                    "10:00 - 14:00"
                }
            },

            new  Specialist
            {
                ID_Specialist = 10,
                Name = "Белова К.Ю.",
                Description = "Ветеринар-эндокринолог занимается диагностикой и лечением заболеваний эндокринной системы животных",
                TypeSpecialist = "Эндокринолог",
                Service = "Анализ крови на гормоны",
                Price= "1600 рублей",
                WorkingHours = new List<string>
                {
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "8:00 - 16:00",
                    "8:00 - 16:00",
                    "- - - - - - -",
                    "10:00 - 14:00"
                }
            },
        };
        public List<Specialist> GetAllSpecialists()
        {
            return AllSpecialist;
        }
    }
}